backend-api/app/Controllers/API/Auth.php

    public function login()
    {
        $model = new UserModel();

        $email = $this->request->getJSON()->email;
        $password = $this->request->getJSON()->password;

        $user = $model
            ->where('email', $email)
            ->first();

        if (!$user) {
            return $this->response
                ->setStatusCode(401)
                ->setJSON([
                    'message' => 'Email tidak ditemukan'
                ]);
        }

        if (!password_verify($password, $user['password'])) {
            return $this->response
                ->setStatusCode(401)
                ->setJSON([
                    'message' => 'Password salah'
                ]);
        }

        $token = bin2hex(random_bytes(32));

        $model->update(
            $user['id'],
            ['token' => $token]
        );
---
SELECT *
FROM `users`
WHERE `email` = 'admin@inventory.com'
 LIMIT 1
UPDATE `users` SET `token` = 'e6f2a616cef44b15e4e23f7abc5af7968d8a1c3dce053eeca7d541808953257d', `updated_at` = '2026-06-22 18:29:07'
WHERE `users`.`id` IN ('3')