backend-api/app/Controllers/API/Dashboard.php

    public function summary()
    {
        $barang = new BarangModel();
        $kategori = new KategoriModel();
        $supplier = new SupplierModel();
        $histori = new HistoriBarangModel();

        return $this->response->setJSON([
            'total_barang' => $barang->countAll(),
            'total_kategori' => $kategori->countAll(),
            'total_supplier' => $supplier->countAll(),
            'total_histori' => $histori->countAll(),
            'total_stok' => $barang->selectSum('stok')->first()['stok'] ?? 0
        ]);
---
SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT COUNT(*) AS `numrows` FROM `kategori`
SELECT COUNT(*) AS `numrows` FROM `supplier`
SELECT COUNT(*) AS `numrows` FROM `histori_barang`
SELECT SUM(`stok`) AS `stok`
FROM `barang`
 LIMIT 1