backend-api/app/Controllers/API/HistoriBarang.php

    public function index()
    {
        $db = db_connect();

        $data = $db->table('histori_barang h')
            ->select('h.*, b.nama_barang, u.nama')
            ->join('barang b', 'b.id = h.id_barang')
            ->join('users u', 'u.id = h.id_user')
            ->orderBy('h.id', 'DESC')
            ->get()
            ->getResult();
---
SELECT `h`.*, `b`.`nama_barang`, `u`.`nama`
FROM `histori_barang` `h`
JOIN `barang` `b` ON `b`.`id` = `h`.`id_barang`
JOIN `users` `u` ON `u`.`id` = `h`.`id_user`
ORDER BY `h`.`id` DESC

    public function create()
    {
        $data = $this->request->getJSON(true);
        $data['id_user'] = $this->request->user['id'];
        $data['tanggal'] = $data['tanggal'] ?? date('Y-m-d');

        // Cek barang ada atau tidak
        $barangModel = new BarangModel();
        $barang = $barangModel->find($data['id_barang']);

        if (!$barang) {
            return $this->failNotFound('Barang tidak ditemukan');
        }

        // Cek dan hitung stok baru
        if ($data['jenis'] == 'masuk') {
            $stokBaru = $barang['stok'] + $data['jumlah'];
        } else {
            if ($barang['stok'] < $data['jumlah']) {
                return $this->fail(['message' => 'Stok tidak mencukupi']);
            }
            $stokBaru = $barang['stok'] - $data['jumlah'];
        }

        // Update stok barang
        $barangModel->update($data['id_barang'], ['stok' => $stokBaru]);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
UPDATE `barang` SET `stok` = 50, `updated_at` = '2026-06-19 13:01:53'
WHERE `barang`.`id` IN ('1')