backend-api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');

        if (empty($authHeader)) {
            return service('response')
                ->setStatusCode(401)
                ->setJSON(['message' => 'Token tidak ditemukan']);
        }

        $token = str_replace('Bearer ', '', $authHeader);

        $model = new UserModel();
        $user = $model->where('token', $token)->first();
---
SELECT *
FROM `users`
WHERE `token` = 'a5b9ca0f6a3915b6907b44c446b0349b43bc807ef4e5c7ff93e215a344144b90'
 LIMIT 1